---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Events.RevitEventArgs
source: html/8dc7ac42-6602-80ad-217a-3839df61c8fa.htm
---
# RevitEventArgs Members

Indicates whether the event is being cancelled.
When the event is cancellable, set the property to True to cancel it.